# Задача 20: *
# В настольной игре Скрабл (Scrabble)
# каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.

# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.

# Напишите программу, которая вычисляет
# стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово,
# которое содержит либо только английские, либо только русские буквы.

# *Пример:*

# ноутбук
#     12

word = str(input('Enter your word: '))
count_1 = ['a', 'e', 'i', 'o', 'u', 'l', 'n', 's', 't', 'r']
count_2 = ['d', 'g']
count_3 = ['b', 'c', 'm', 'p']
count_4 = ['f', 'h', 'v', 'w', 'y']
count_5 = ['k']
count_8 = ['j', 'x']
count_10 = ['q', 'z']
value = 0

for i in word:
    if i in count_1:
        value += 1
    if i in count_2:
        value += 2
    if i in count_3:
        value += 3
    if i in count_4:
        value += 4
    if i in count_5:
        value += 5
    if i in count_8:
        value += 8
    if i in count_10:
        value += 10

print(f'The value of your word "{word}" is {value}')